---
title: Leader
classe: Autodesk.Revit.DB.Leader
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# Leader

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ Anchor { get; }` | `leader.Anchor` | XYZ |
| `XYZ Elbow { get; set; }` | `leader.Elbow` | XYZ |
| `XYZ End { get; set; }` | `leader.End` | XYZ |
| `Boolean IsValidObject { get; }` | `leader.IsValidObject` | Boolean |
| `LeaderShape LeaderShape { get; }` | `leader.LeaderShape` | LeaderShape |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```